#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_availability_zones.available: Reading...
aws_apigatewayv2_api.apigw_http_endpoint: Refreshing state... [id=5w717akph4]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-09588034d45d4bae9]
module.ecs.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:369168831564:cluster/ecs-fargate]
module.ecs.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=ecs-fargate]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
aws_apigatewayv2_stage.apigw_stage: Refreshing state... [id=$default]
aws_security_group.vpc_endpoints_security_group: Refreshing state... [id=sg-0ba664ff0411d6365]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-04a91dabe319645d7]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-069f38a28c0fd50b1]
aws_security_group.ecs_security_group: Refreshing state... [id=sg-0a4da3a6cadecdb46]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-02d94528217dce7a0]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-05bbd722c95dce46e]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0e744c5ae26360bdc]
aws_security_group.lb_security_group: Refreshing state... [id=sg-0d2a6273641c0725a]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0182202da92a2c69d]
aws_security_group_rule.sg_ingress_rule_all_to_lb: Refreshing state... [id=sgrule-3671881763]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-042da88ceaa10980c]
aws_security_group_rule.sg_egress_rule_lb_to_ecs_cluster: Refreshing state... [id=sgrule-3061425185]
aws_security_group_rule.sg_ingress_rule_ecr_vpc_endpoint_from_ecs_cluster: Refreshing state... [id=sgrule-153097154]
aws_security_group_rule.sg_ingress_rule_ecs_cluster_from_lb: Refreshing state... [id=sgrule-2583278897]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0676e5f4c9d0ab821]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0fce9589b8cc3ca29]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-07c38b89b64fe288e]
aws_vpc_endpoint.ecr_dkr_endpoint: Refreshing state... [id=vpce-0703d54e374e401b1]
aws_apigatewayv2_vpc_link.vpclink_apigw_to_alb: Refreshing state... [id=yf3xce]
aws_lb.ecs_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:loadbalancer/app/tf-lb-20230116125743651400000008/908d01a8ba2edfb0]
aws_vpc_endpoint.ecr_api_endpoint: Refreshing state... [id=vpce-0f146bf9454fb9ca8]
aws_vpc_endpoint.cloudwatch_vpc_endpoint: Refreshing state... [id=vpce-0c9ceaddb16e2905a]
aws_lb_listener.ecs_alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:listener/app/tf-lb-20230116125743651400000008/908d01a8ba2edfb0/cbaae90a9c597e5f]
aws_apigatewayv2_integration.apigw_integration: Refreshing state... [id=z7qayis]
aws_apigatewayv2_route.apigw_route: Refreshing state... [id=2r8m23v]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_apigatewayv2_integration.apigw_integration will be updated in-place
  ~ resource "aws_apigatewayv2_integration" "apigw_integration" {
        id                     = "z7qayis"
      ~ integration_uri        = "arn:aws:elasticloadbalancing:us-east-1:369168831564:listener/app/tf-lb-20230116125743651400000008/908d01a8ba2edfb0/cbaae90a9c597e5f" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # aws_lb.ecs_alb must be replaced
-/+ resource "aws_lb" "ecs_alb" {
      ~ arn                              = "arn:aws:elasticloadbalancing:us-east-1:369168831564:loadbalancer/app/tf-lb-20230116125743651400000008/908d01a8ba2edfb0" -> (known after apply)
      ~ arn_suffix                       = "app/tf-lb-20230116125743651400000008/908d01a8ba2edfb0" -> (known after apply)
      ~ dns_name                         = "internal-tf-lb-20230116125743651400000008-2000869557.us-east-1.elb.amazonaws.com" -> (known after apply)
      - enable_cross_zone_load_balancing = true -> null
      ~ id                               = "arn:aws:elasticloadbalancing:us-east-1:369168831564:loadbalancer/app/tf-lb-20230116125743651400000008/908d01a8ba2edfb0" -> (known after apply)
      ~ ip_address_type                  = "ipv4" -> (known after apply)
      ~ name                             = "tf-lb-20230116125743651400000008" -> "demo-alb" # forces replacement
      ~ security_groups                  = [
          - "sg-0d2a6273641c0725a",
        ] -> (known after apply)
        tags                             = {
            "environment" = "dev"
            "project"     = "demo"
        }
      ~ vpc_id                           = "vpc-09588034d45d4bae9" -> (known after apply)
      ~ zone_id                          = "Z35SXDOTRQ7X7K" -> (known after apply)
        # (11 unchanged attributes hidden)

      - access_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-05bbd722c95dce46e" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-069f38a28c0fd50b1" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0e744c5ae26360bdc" -> null
        }
      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.ecs_alb_listener must be replaced
-/+ resource "aws_lb_listener" "ecs_alb_listener" {
      ~ arn               = "arn:aws:elasticloadbalancing:us-east-1:369168831564:listener/app/tf-lb-20230116125743651400000008/908d01a8ba2edfb0/cbaae90a9c597e5f" -> (known after apply)
      ~ id                = "arn:aws:elasticloadbalancing:us-east-1:369168831564:listener/app/tf-lb-20230116125743651400000008/908d01a8ba2edfb0/cbaae90a9c597e5f" -> (known after apply)
      ~ load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:369168831564:loadbalancer/app/tf-lb-20230116125743651400000008/908d01a8ba2edfb0" -> (known after apply) # forces replacement
      + ssl_policy        = (known after apply)
        tags              = {
            "environment" = "dev"
            "project"     = "demo"
        }
        # (3 unchanged attributes hidden)

      ~ default_action {
          ~ order = 1 -> (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }
    }

  # aws_security_group.ecs_security_group must be replaced
-/+ resource "aws_security_group" "ecs_security_group" {
      ~ arn                    = "arn:aws:ec2:us-east-1:369168831564:security-group/sg-0a4da3a6cadecdb46" -> (known after apply)
      ~ id                     = "sg-0a4da3a6cadecdb46" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Ingress from Load Balancer"
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0d2a6273641c0725a",
                ]
              - self             = false
              - to_port          = 8080
            },
        ] -> (known after apply)
      ~ name                   = "terraform-20230116125741730900000002" -> "demo-ecs-sg" # forces replacement
      ~ name_prefix            = "terraform-" -> (known after apply)
      ~ owner_id               = "369168831564" -> (known after apply)
        tags                   = {
            "environment" = "dev"
            "project"     = "demo"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_security_group.lb_security_group must be replaced
-/+ resource "aws_security_group" "lb_security_group" {
      ~ arn                    = "arn:aws:ec2:us-east-1:369168831564:security-group/sg-0d2a6273641c0725a" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = []
              - description      = "Target group egress"
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0a4da3a6cadecdb46",
                ]
              - self             = false
              - to_port          = 8080
            },
        ] -> (known after apply)
      ~ id                     = "sg-0d2a6273641c0725a" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow from anyone on port 80"
              - from_port        = 80
              - ipv6_cidr_blocks = [
                  - "::/0",
                ]
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> (known after apply)
      ~ name                   = "terraform-20230116125741733400000003" -> "demo-alb-sg" # forces replacement
      ~ name_prefix            = "terraform-" -> (known after apply)
      ~ owner_id               = "369168831564" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_security_group.vpc_endpoints_security_group must be replaced
-/+ resource "aws_security_group" "vpc_endpoints_security_group" {
      ~ arn                    = "arn:aws:ec2:us-east-1:369168831564:security-group/sg-0ba664ff0411d6365" -> (known after apply)
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-0ba664ff0411d6365" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Ingress from ECS cluster"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0a4da3a6cadecdb46",
                ]
              - self             = false
              - to_port          = 443
            },
        ] -> (known after apply)
      ~ name                   = "terraform-20230116125741721500000001" -> "demo-vpc-endpoint-sg" # forces replacement
      ~ name_prefix            = "terraform-" -> (known after apply)
      ~ owner_id               = "369168831564" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_security_group_rule.sg_egress_rule_lb_to_ecs_cluster must be replaced
-/+ resource "aws_security_group_rule" "sg_egress_rule_lb_to_ecs_cluster" {
      ~ id                       = "sgrule-3061425185" -> (known after apply)
      ~ security_group_id        = "sg-0d2a6273641c0725a" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0782de2c8b5bfea3a" -> (known after apply)
      ~ source_security_group_id = "sg-0a4da3a6cadecdb46" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # aws_security_group_rule.sg_ingress_rule_all_to_lb must be replaced
-/+ resource "aws_security_group_rule" "sg_ingress_rule_all_to_lb" {
      ~ id                       = "sgrule-3671881763" -> (known after apply)
      ~ security_group_id        = "sg-0d2a6273641c0725a" -> (known after apply) # forces replacement
      + security_group_rule_id   = (known after apply)
      + source_security_group_id = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_security_group_rule.sg_ingress_rule_ecr_vpc_endpoint_from_ecs_cluster must be replaced
-/+ resource "aws_security_group_rule" "sg_ingress_rule_ecr_vpc_endpoint_from_ecs_cluster" {
      ~ id                       = "sgrule-153097154" -> (known after apply)
      ~ security_group_id        = "sg-0ba664ff0411d6365" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0c6f6dbe9200ff7bc" -> (known after apply)
      ~ source_security_group_id = "sg-0a4da3a6cadecdb46" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # aws_security_group_rule.sg_ingress_rule_ecs_cluster_from_lb must be replaced
-/+ resource "aws_security_group_rule" "sg_ingress_rule_ecs_cluster_from_lb" {
      ~ id                       = "sgrule-2583278897" -> (known after apply)
      ~ security_group_id        = "sg-0a4da3a6cadecdb46" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-0cc9433daab35e0eb" -> (known after apply)
      ~ source_security_group_id = "sg-0d2a6273641c0725a" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # aws_vpc_endpoint.cloudwatch_vpc_endpoint will be updated in-place
  ~ resource "aws_vpc_endpoint" "cloudwatch_vpc_endpoint" {
        id                    = "vpce-0c9ceaddb16e2905a"
      ~ security_group_ids    = [
          - "sg-0ba664ff0411d6365",
        ] -> (known after apply)
        tags                  = {}
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_vpc_endpoint.ecr_api_endpoint will be updated in-place
  ~ resource "aws_vpc_endpoint" "ecr_api_endpoint" {
        id                    = "vpce-0f146bf9454fb9ca8"
      ~ security_group_ids    = [
          - "sg-0ba664ff0411d6365",
        ] -> (known after apply)
        tags                  = {}
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_vpc_endpoint.ecr_dkr_endpoint will be updated in-place
  ~ resource "aws_vpc_endpoint" "ecr_dkr_endpoint" {
        id                    = "vpce-0703d54e374e401b1"
      ~ security_group_ids    = [
          - "sg-0ba664ff0411d6365",
        ] -> (known after apply)
        tags                  = {}
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 9 to add, 4 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf_plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf_plan"

```

</details>

*Pusher: @liamfit, Action: `pull_request`, Workflow: `Terraform`*